<?php
/**
 * Created by PhpStorm.
 * User: lawrence
 * Date: 6/25/18
 * Time: 2:22 PM
 * 基础选项配置 -- zh-CN
 */;

return [
    'isTester'    => [ // 是否测试账号
        0 => '否',
        1 => '是',
    ],
    'isTrue'      => [ // 0 =否 1=是
        0 => '否',
        1 => '是',
    ],
    'projects'    => [ // 注单
        'status'      => [ // 状态
            '0' => '待开奖',
            '1' => '已撤销',
            '2' => '未中奖',
            '3' => '已中奖',
            '4' => '已派奖',
            '5' => '系统撤销',//通过redis和帐变表去重复
        ],
    ],
    'traces' => [
        'status' => [
            0 => '进行中',
            1 => '已完成',
            2 => '用户终止',
            3 => '管理员中止',
            4 => '系统终止',
        ],
    ],
    'trace_details' => [
        'status' => [
            0 => '进行中',
            1 => '已完成',
            2 => '用户终止',
            3 => '管理员中止',
            4 => '系统终止',
            5 => '注单已撤销'
        ],
    ],
    'risk_projects' => [
        'status' => [
            0 => '待审核',
            1 => '审核通过',
            2 => '审核未通过',
        ],
    ],
    'issues'      => [   // 奖期表
        'status' => [ //  奖期状态
            '1'  => '等待开奖',
            '2'  => '已输入号码,等待审核',
            '4'  => '号码已审核',
            '8'  => '号码已取消开奖',
            '32' => '提前开奖A，获取到开奖号码的时间早于官方理论开奖时间',
            '64' => '提前开奖B，获取到开奖号码的时间早于销售截止时间',
        ],
        'group_type'=>[ //返点类型
            1 => '奖金组返点',
            2 => '百分比返点',
        ],
        'operate_type' => [
            1   => '修改开奖号码',
            2   => '取消开奖号码',
            3   => '提前开奖',
        ],
    ],
    'issue_warnings' => [
        'status' => [
            0 => '未处理',
            1 => '已处理',
        ],
    ],
    'terminal'    => [ // 终端
        'status' => [ // 状态
            0 => '关闭',
            1 => '测试',
            2 => '正式',
        ],
    ],
    'terminal_lottery' => [
        'status' => [ // 状态
            0   => '关闭',
            1   => '测试',
            3   => '可用',
        ],
    ],
    'lottery'     => [  // 彩种
        'type' => [   // 类型
            1 => '数字型',
            2 => '乐透型',
            3 => '体育型',
            4 => '真人娱乐型',
            5 => 'Ga Game',
        ],
        'status'=>[
            0 => '关闭',
            1 => '测试账户可用',
            2 => '正式账户可用',  //废弃
            3 => '正常销售',
            4 => '开发中',
            8 => '永久关闭'
        ],
        'lotto_type'=>[
            1 => '单区乐透',
            2 => '双区乐透',
        ],
    ],
    'rest_settings' => [
        'periodic' => [
            0 => '一次',
            1 => '重复'
        ],
    ],
    'method_type' => [ // 玩法类型表
        'attribute_code' => [ // 特征码
            'A' => '区间',
            'S' => '大小单双',
            'C' => '不定位',
            'I' => '趣味',
            'O' => '原始',
        ],
    ],
    'merchant'    => [ // 商户
        'status'       => [ // 状态
            0 => '未激活',
            1 => '激活',
        ],
        'is_tester'    => [ // 是否测试商户
            0 => '否',
            1 => '是',
        ],
        'profit_type'  => [ // 计费方式
            1 => '负盈利模式',// 不计算限额，只是从负盈利报表中
            2 => '信用额度减扣',// 每次投注从信用额度中扣除信用额度
        ],
        'close_status' => [
            0 => '关闭',
            1 => '开启',
        ],
    ],
    'series'      => [ // 系列
        'lotto_type' => [ // 乐透类型
            1 => '单区乐透',
            2 => '双区乐透',
        ],
        'group_type' => [ // 返点类型
            1 => '奖金组',
            2 => '百分比',
        ],
    ],
    'fund'        => [ // 资金
        'transfer_info_type' => [ // 转账记录-转账类型
            1 => '转入',
            2 => '转出',
        ],
    ],
    'fund_flow' => [
        'action' => [
            0   => '固定',
            1   => '增加',
            -1  => '减少',
        ],
    ],
    'user'        => [ //  用户
        'blocked'      => [  // 冻结状态
            0 => '正常',
            1 => '冻结',
        ],
        'blocked_type' => [ // 冻结类型
            0 => '解除冻结', // unblock
            1 => '禁止登录', // block-login
            2 => '禁止投注',     // block-bet
            3 => '禁止资金操作',       // block-fund
        ],
    ],
    'audit'=>[ // 审核表
        'status'=>[
            0=>'审核中',
            1=>'审核通过',
            2=>'审核拒绝',
        ]
    ]

];